Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Металл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вставка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СерииНоменклатуры</Name>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B1_ОсновнаяСерияВБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесМеталла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Размер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварнаяПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеПозиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦветМеталла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветаМеталла</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесМеталлаГИИСДМДК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбщийВесВставок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесМеталлаВЧистоте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбщийВесВставокГИИСДМДК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесМеталлаВЧистотеГИИСДМДК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВесоваяГруппаГИИСДМДК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторВесовыхГруппГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтепеньВнутреннегоОтраженияГИИСДМДК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтепенейВнутреннегоОтраженияГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаличиеСколовДефектовГИИСДМДК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторНаличияСколовДефектовГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ГруппаОгранкиГИИСДМДК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторГруппОгранкиГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяКлассификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительнаяКлассификацияГИИСДМДК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕстьФизическаяМаркировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НельзяНанестиФизическуюМаркировку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидПартийГИИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПартийГИИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>УИН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПодборыУ/Ext/Module.bsl
//&ИзменениеИКонтроль("ПрисвоитьШтрихкодыТовару")
//Процедура B1_ПрисвоитьШтрихкодыТовару(Документ)

//	Если Константы.ПрефиксВнутреннегоШтрихкода.Получить() = 0 Тогда

//		Константы.ПрефиксВнутреннегоШтрихкода.Установить(20);

//		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Константа ""Префикс внутреннего штрих-кода"" не установлена.
//														   |Установлено значение по умолчанию - ""20"".");

//	КонецЕсли;

//	ПрефиксШтрихкода = Формат(Константы.ПрефиксВнутреннегоШтрихкода.Получить(), "ЧГ=0");

//	МетаданныеТекДокумента = Документ.Метаданные();
//	
//	ЭтоВводОстатков			= МетаданныеТекДокумента.Имя = "ВводНачальныхОстатков";
//	ЭтоСкупка   			= МетаданныеТекДокумента.Имя = "СкупкаТоваров";
//		
//	ЕстьКонтрагент          = МетаданныеТекДокумента.Имя <> "ВозвратТоваровОтПокупателя"
//		И ОбщегоНазначения.ЕстьРеквизитДокумента("Контрагент", МетаданныеТекДокумента);
//	ЕстьЦветМеталла         = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ЦветМеталла", МетаданныеТекДокумента,
//		"Товары");

//	ЕстьВесВставок           = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ВесВставок", МетаданныеТекДокумента,
//		"Товары");
//	НужноУчитыватьВесВставок = ОбщегоНазначения.ЕстьРеквизитДокумента("РучнойУчетВесаВставок", МетаданныеТекДокумента)
//		И Документ.РучнойУчетВесаВставок;

//	СобственныйКонтрагент = ?(ЕстьКонтрагент, УправлениеВзаиморасчетами.ПолучитьОрганизациюПоКонтрагенту(
//		Документ.Контрагент), Неопределено);

//	Если ЭтоСкупка Тогда	
//		СтруктураСИзменениями = ПроверитьИзмененияПоТабличнойЧастиДокументаСкупка(Документ.Товары, МетаданныеТекДокумента.Имя,
//			Документ.Контрагент, Документ.ДоговорКонтрагента,
//			Документ.ВидПринимаемыхЦенностей);		
// 	ИначеЕсли ЕстьКонтрагент и НЕ ЗначениеЗаполнено(СобственныйКонтрагент) Тогда
//		СтруктураСИзменениями = ЮвелирнаяТорговля.ПроверитьИзмененияПоТабличнойЧастиДокумента(Документ.Товары, МетаданныеТекДокумента.Имя,
//			Документ.Контрагент, Документ.ДоговорКонтрагента,
//			ЕстьВесВставок);		
//	Иначе
//		СтруктураСИзменениями = ЮвелирнаяТорговля.ПроверитьИзмененияПоТабличнойЧастиДокумента(Документ.Товары, МетаданныеТекДокумента.Имя,
//			Неопределено, Неопределено,
//			ЕстьВесВставок);		
//	КонецЕсли;	
//	
//	МассивПустыхСерий = СтруктураСИзменениями.МассивПустыхСерий;
//	МассивСерийДляЗаписи = СтруктураСИзменениями.МассивИзмененныхСерий;
//	МассивСерий = Новый Массив;
//	Для Каждого МассивИзменений Из МассивСерийДляЗаписи Цикл
//		КолВоИзменений = МассивИзменений.Количество();
//		ТекСерия = МассивИзменений[0];
//		СерияНоменклатуры = ТекСерия.ПолучитьОбъект();
//		Пока КолВоИзменений > 1 Цикл
//			КолВоИзменений = КолВоИзменений - 1;
//			СтруктураРеквизита = МассивИзменений[КолВоИзменений];
//			Если СтруктураРеквизита.ИмяРеквизитаПриемник = "УИН" И СтруктураРеквизита.ЗначениеРеквизита = "" Тогда
//				Продолжить;
//			ИначеЕсли СтруктураРеквизита.ИмяРеквизитаПриемник = "ВидПартийГИИС" И ЗначениеЗаполнено(СтруктураРеквизита.ЗначениеРеквизита) = Ложь Тогда
//				Продолжить;
//			ИначеЕсли СтруктураРеквизита.ИмяРеквизитаПриемник = "ДополнительнаяКлассификация" И ЗначениеЗаполнено(СтруктураРеквизита.ЗначениеРеквизита) = Ложь Тогда
//				Продолжить;
//			ИначеЕсли СтруктураРеквизита.ИмяРеквизитаПриемник = "ЕстьФизическаяМаркировка" И СтруктураРеквизита.ЗначениеРеквизита = Ложь Тогда
//				Продолжить;
//			ИначеЕсли СтруктураРеквизита.ИмяРеквизитаПриемник = "НельзяНанестиФизическуюМаркировку" И СтруктураРеквизита.ЗначениеРеквизита = Ложь Тогда
//				Продолжить;			
//			Иначе	
//				#Вставка
//				Если ТипЗнч(Документ) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") И СтруктураРеквизита.ИмяРеквизитаПриемник = "УИН" И ЗначениеЗаполнено(СтруктураРеквизита.ЗначениеРеквизита) Тогда
//					СерияНоменклатуры.Наименование = СтруктураРеквизита.ЗначениеРеквизита;
//				КонецЕсли;
//				#КонецВставки
//				СерияНоменклатуры[СтруктураРеквизита.ИмяРеквизитаПриемник] = СтруктураРеквизита.ЗначениеРеквизита;
//			КонецЕсли;
//		КонецЦикла;	
//		СерияНоменклатуры.Записать();
//		МассивСерий.Добавить(ТекСерия);
//	КонецЦикла;
//	
//	ДатаНачалаПрисвоенияСерийМеталлам = Константы.ДатаНачалаПрисвоенияСерийМеталлам.Получить();
//	Если ДатаНачалаПрисвоенияСерийМеталлам > Документ.Дата или ДатаНачалаПрисвоенияСерийМеталлам = Дата(1, 1, 1) Тогда
//		ВестиУчетМеталлаПоСериям = Ложь;
//	Иначе
//		ВестиУчетМеталлаПоСериям = Истина;
//	КонецЕсли;
//	
//	ДатаНачалаПрисвоенияСерийКамням = Константы.ДатаНачалаПрисвоенияСерийКамням.Получить();
//	Если ДатаНачалаПрисвоенияСерийКамням > Документ.Дата или ДатаНачалаПрисвоенияСерийКамням = Дата(1, 1, 1) Тогда
//		ВестиУчетКамнейПоСериям = Ложь;
//	Иначе
//		ВестиУчетКамнейПоСериям = Истина;
//	КонецЕсли;
//	
//	Для Каждого СтрокаТоваров Из МассивПустыхСерий Цикл
//		Номенклатура = СтрокаТоваров.Номенклатура;
//		
//		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
//			
//			Продолжить;
//			
//		КонецЕсли;
//		
//		Если (СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар
//			или (СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Металл и ВестиУчетМеталлаПоСериям = Истина 
//				и СтрокаТоваров.НеДрагМеталл = Ложь)
//			или (СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Вставка и ВестиУчетКамнейПоСериям = Истина)
//			или СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Бижутерия
//			или СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЮвелирноеИзделие) Тогда
//			
//			Если СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЮвелирноеИзделие 
//				и СтрокаТоваров.Количество <> 1 Тогда
//				
//				Текст = "Штрих-код изделию """ + Номенклатура.Наименование + """ не присвоен. 
//				|Штрих-код присваивается изделиям с видом номенклатуры ""Ювелирное изделие"" только при количестве равном 1.";
//				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(Текст, Документ, "Товары[" + (СтрокаТоваров.НомерСтроки - 1) + "].СерияНоменклатуры");
//				
//				Продолжить;
//				
//			КонецЕсли;
//			
//			Если СтрокаТоваров.Вес <> 0 и СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар Тогда
//				
//				Текст = "Штрих-код изделию """ + Номенклатура.Наименование + """ не присвоен. 
//				|Штрих-код присваивается изделиям с видом номенклатуры ""товар"" без указания веса.";
//				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(Текст, Документ, "Товары[" + (СтрокаТоваров.НомерСтроки - 1) + "].СерияНоменклатуры");
//				
//				Продолжить;
//				
//			КонецЕсли;
//			
//			Если СтрокаТоваров.Вес = 0 и СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Металл Тогда
//				
//				Текст = "Штрих-код изделию """ + Номенклатура.Наименование + """ не присвоен. 
//				|Штрих-код присваивается изделиям с видом номенклатуры ""металл"" только при весе большем нуля.";
//				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(Текст, Документ, "Товары[" + (СтрокаТоваров.НомерСтроки - 1) + "].СерияНоменклатуры");
//				
//				Продолжить;
//				
//			КонецЕсли;
//			
//			Если СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Вставка И (СтрокаТоваров.Вес = 0 Или СтрокаТоваров.Количество = 0) Тогда
//				
//				Текст = "Штрих-код изделию """ + Номенклатура.Наименование + """ не присвоен. 
//				|Штрих-код присваивается изделиям с видом номенклатуры ""вставка"" только при количестве и весе большем нуля.";
//				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(Текст, Документ, "Товары[" + (СтрокаТоваров.НомерСтроки - 1) + "].СерияНоменклатуры");
//				
//				Продолжить;
//				
//			КонецЕсли;

//			СерияНоменклатурыОбъект = Справочники.СерииНоменклатуры.СоздатьЭлемент();
//			СерияНоменклатурыОбъект.УстановитьНовыйКод();
//			
//			Штрихкод = ПрефиксШтрихкода + Прав("000000000000000000" + СерияНоменклатурыОбъект.Код, 12 - СтрДлина(
//			ПрефиксШтрихкода));
//			
//			СерияНоменклатурыОбъект.Владелец     = Номенклатура;
//			СерияНоменклатурыОбъект.Наименование = Штрихкод + УправлениеРозничнойТорговлей.КонтрольныйСимволEAN(
//			Штрихкод, 13);
//			
//			Если СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Металл Тогда
//				СерияНоменклатурыОбъект.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
//				СерияНоменклатурыОбъект.Размер                     = Справочники.Размер.ПустаяСсылка();
//				СерияНоменклатурыОбъект.Количество                 = 0;
//				СерияНоменклатурыОбъект.Весовой 				   = 1;
//			ИначеЕсли ЭтоСкупка Тогда
//				СерияНоменклатурыОбъект.ХарактеристикаНоменклатуры = СтрокаТоваров.ХарактеристикаНоменклатуры;
//				СерияНоменклатурыОбъект.Размер                     = СтрокаТоваров.Размер;
//				СерияНоменклатурыОбъект.Количество                 = СтрокаТоваров.Количество;
//				СерияНоменклатурыОбъект.Весовой 				   = 1;
//			Иначе	
//				СерияНоменклатурыОбъект.ХарактеристикаНоменклатуры = СтрокаТоваров.ХарактеристикаНоменклатуры;
//				СерияНоменклатурыОбъект.Размер                     = СтрокаТоваров.Размер;
//				СерияНоменклатурыОбъект.Количество                 = СтрокаТоваров.Количество;	
//				СтрокаТоваров.Свойство("Весовой", СерияНоменклатурыОбъект.Весовой);
//			КонецЕсли;
//				
//			СерияНоменклатурыОбъект.Вес = СтрокаТоваров.Вес;
//			СерияНоменклатурыОбъект.ВесМеталла = СтрокаТоваров.ВесМеталла;
//			
//			СерияНоменклатурыОбъект.ОбщийВесВставок = СтрокаТоваров.ОбщийВесВставок;
//			
//			СерияНоменклатурыОбъект.ВесМеталлаВЧистоте = СтрокаТоваров.ВесМеталлаВХимЧистоте;
//			
//			СтрокаТоваров.Свойство("Качество", СерияНоменклатурыОбъект.Качество);
//			СтрокаТоваров.Свойство("НомерГТД", СерияНоменклатурыОбъект.НомерГТД);
//			СтрокаТоваров.Свойство("СтранаПроисхождения", СерияНоменклатурыОбъект.СтранаПроисхождения);
//			СтрокаТоваров.Свойство("Паспорт", СерияНоменклатурыОбъект.НомерПаспорта);
//			СтрокаТоваров.Свойство("УИН", СерияНоменклатурыОбъект.УИН);
//			СтрокаТоваров.Свойство("ЦветМеталла", СерияНоменклатурыОбъект.ЦветМеталла);
//			
//			СтрокаТоваров.Свойство("ЕстьФизическаяМаркировка", СерияНоменклатурыОбъект.ЕстьФизическаяМаркировка);
//			СтрокаТоваров.Свойство("НельзяНанестиФизическуюМаркировку", СерияНоменклатурыОбъект.НельзяНанестиФизическуюМаркировку);
//			СтрокаТоваров.Свойство("ВидПартийГИИС", СерияНоменклатурыОбъект.ВидПартийГИИС);
//			СтрокаТоваров.Свойство("ДополнительнаяКлассификация", СерияНоменклатурыОбъект.ДополнительнаяКлассификация);
//			
//			Если СтрокаТоваров.Свойство("ЦветМеталла") = Истина Тогда
//				Если ЗначениеЗаполнено(СтрокаТоваров.ЦветМеталла) Тогда
//					
//					СерияНоменклатурыОбъект.ЦветМеталла = СтрокаТоваров.ЦветМеталла;
//					
//				ИначеЕсли ЗначениеЗаполнено(СтрокаТоваров.Номенклатура.ЦветМеталла) Тогда
//					
//					СерияНоменклатурыОбъект.ЦветМеталла = СтрокаТоваров.Номенклатура.ЦветМеталла;
//					
//				КонецЕсли;
//			КонецЕсли;
//			
//			// Заполнять поставщика будем только, если это не собственный контрагент.
//			Если ЕстьКонтрагент И Не ЗначениеЗаполнено(СобственныйКонтрагент) Тогда
//				
//				СерияНоменклатурыОбъект.Поставщик       = СтрокаТоваров.Контрагент;
//				СерияНоменклатурыОбъект.ДоговорПоставки = СтрокаТоваров.ДоговорКонтрагента;
//				
//			ИначеЕсли ЭтоВводОстатков И ЗначениеЗаполнено(СтрокаТоваров.ДокументОприходования) Тогда
//				
//				ЗначенияРеквизитов = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтрокаТоваров.ДокументОприходования,
//				"Контрагент,ДоговорКонтрагента");
//				
//				СерияНоменклатурыОбъект.Поставщик       = ЗначенияРеквизитов.Контрагент;
//				СерияНоменклатурыОбъект.ДоговорПоставки = ЗначенияРеквизитов.ДоговорКонтрагента;
//				
//			КонецЕсли;
//			
//			СерияНоменклатурыОбъект.ДополнительныеСвойства.Вставить("ПроведениеДокумента", Истина);
//			СерияНоменклатурыОбъект.Записать();
//			
//			Документ.Товары[СтрокаТоваров.НомерСтроки - 1].СерияНоменклатуры = СерияНоменклатурыОбъект.Ссылка;
//			
//			МассивСерий.Добавить(СерияНоменклатурыОбъект.Ссылка);
//			
//		КонецЕсли;
//		
//	КонецЦикла;	
//	// Обновление ассортиментной матрицы
//	Если Справочники.НастройкаАссортиментнойМатрицы.ОсновнаяНастройка.ИспользуетсяАссортиментнаяМатрица
//		И МассивСерий.Количество() > 0 Тогда
//		ЮвелирнаяТорговля.ювЗаполнитьСериюПоАссортиментнойМатрицеДляСпискаСерий(МассивСерий);
//	КонецЕсли;

//КонецПроцедуры 

&ИзменениеИКонтроль("ПрисвоитьШтрихкодыТовару")
Процедура B1_ПрисвоитьШтрихкодыТовару(Документ)

	Если Константы.ПрефиксВнутреннегоШтрихкода.Получить() = 0 Тогда

		Константы.ПрефиксВнутреннегоШтрихкода.Установить(20);

		ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю("Константа ""Префикс внутреннего штрих-кода"" не установлена.
		|Установлено значение по умолчанию - ""20"".");

	КонецЕсли;

	ПрефиксШтрихкода = Формат(Константы.ПрефиксВнутреннегоШтрихкода.Получить(), "ЧГ=0");

	МетаданныеТекДокумента = Документ.Метаданные();

	ЭтоВводОстатков			= МетаданныеТекДокумента.Имя = "ВводНачальныхОстатков";
	ЭтоСкупка   			= МетаданныеТекДокумента.Имя = "СкупкаТоваров";

	ЕстьКонтрагент          = МетаданныеТекДокумента.Имя <> "ВозвратТоваровОтПокупателя"
	И ОбщегоНазначения.ЕстьРеквизитДокумента("Контрагент", МетаданныеТекДокумента);
	ЕстьЦветМеталла         = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ЦветМеталла", МетаданныеТекДокумента,
	"Товары");

	ЕстьВесВставок           = ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ВесВставок", МетаданныеТекДокумента,
	"Товары");
	НужноУчитыватьВесВставок = ОбщегоНазначения.ЕстьРеквизитДокумента("РучнойУчетВесаВставок", МетаданныеТекДокумента)
	И Документ.РучнойУчетВесаВставок;

	СобственныйКонтрагент = ?(ЕстьКонтрагент, УправлениеВзаиморасчетами.ПолучитьОрганизациюПоКонтрагенту(
	Документ.Контрагент), Неопределено);

	ЕстьРазрушительныйАнализ = ОбщегоНазначения.ЕстьРеквизитДокумента("РазрушительныйАнализ", МетаданныеТекДокумента);

	Если ЭтоСкупка Тогда	
		СтруктураСИзменениями = ПроверитьИзмененияПоТабличнойЧастиДокументаСкупка(Документ.Товары, МетаданныеТекДокумента.Имя,
		Документ.Контрагент, Документ.ДоговорКонтрагента,
		Документ.ВидПринимаемыхЦенностей);		
	ИначеЕсли ЕстьКонтрагент и НЕ ЗначениеЗаполнено(СобственныйКонтрагент) Тогда
		СтруктураСИзменениями = ЮвелирнаяТорговля.ПроверитьИзмененияПоТабличнойЧастиДокумента(Документ.Товары, МетаданныеТекДокумента.Имя,
		Документ.Контрагент, Документ.ДоговорКонтрагента,
		ЕстьВесВставок);		
	Иначе
		СтруктураСИзменениями = ЮвелирнаяТорговля.ПроверитьИзмененияПоТабличнойЧастиДокумента(Документ.Товары, МетаданныеТекДокумента.Имя,
		Неопределено, Неопределено,
		ЕстьВесВставок);		
	КонецЕсли;	

	МассивПустыхСерий = СтруктураСИзменениями.МассивПустыхСерий;
	МассивСерийДляЗаписи = СтруктураСИзменениями.МассивИзмененныхСерий;
	МассивСерий = Новый Массив;
	Для Каждого МассивИзменений Из МассивСерийДляЗаписи Цикл
		КолВоИзменений = МассивИзменений.Количество();
		ТекСерия = МассивИзменений[0];
		СерияНоменклатуры = ТекСерия.ПолучитьОбъект();
		Пока КолВоИзменений > 1 Цикл
			КолВоИзменений = КолВоИзменений - 1;
			СтруктураРеквизита = МассивИзменений[КолВоИзменений];
			Если СтруктураРеквизита.ИмяРеквизитаПриемник = "УИН" И СтруктураРеквизита.ЗначениеРеквизита = "" Тогда
				Продолжить;
			ИначеЕсли СтруктураРеквизита.ИмяРеквизитаПриемник = "ВидПартийГИИС" И ЗначениеЗаполнено(СтруктураРеквизита.ЗначениеРеквизита) = Ложь Тогда
				Продолжить;
			ИначеЕсли СтруктураРеквизита.ИмяРеквизитаПриемник = "ДополнительнаяКлассификация" И ЗначениеЗаполнено(СтруктураРеквизита.ЗначениеРеквизита) = Ложь Тогда
				Продолжить;
			ИначеЕсли СтруктураРеквизита.ИмяРеквизитаПриемник = "ЕстьФизическаяМаркировка" И СтруктураРеквизита.ЗначениеРеквизита = Ложь Тогда
				Продолжить;
			ИначеЕсли СтруктураРеквизита.ИмяРеквизитаПриемник = "НельзяНанестиФизическуюМаркировку" И СтруктураРеквизита.ЗначениеРеквизита = Ложь Тогда
				Продолжить;
			ИначеЕсли СтруктураРеквизита.ИмяРеквизитаПриемник = "СтатусМаркировки" 
				И СтруктураРеквизита.ЗначениеРеквизита = Перечисления.СтатусыМаркировки.ПустаяСсылка() Тогда
				Продолжить;
			Иначе	
				#Вставка
				Если ТипЗнч(Документ) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") И СтруктураРеквизита.ИмяРеквизитаПриемник = "УИН" И ЗначениеЗаполнено(СтруктураРеквизита.ЗначениеРеквизита) Тогда
					СерияНоменклатуры.Наименование = СтруктураРеквизита.ЗначениеРеквизита;
				КонецЕсли;
				#КонецВставки
				СерияНоменклатуры[СтруктураРеквизита.ИмяРеквизитаПриемник] = СтруктураРеквизита.ЗначениеРеквизита;
			КонецЕсли;
		КонецЦикла;	       
		Если СерияНоменклатуры.ЕстьФизическаяМаркировка 
			И СерияНоменклатуры.СтатусМаркировки = Перечисления.СтатусыМаркировки.ПустаяСсылка() Тогда
			СерияНоменклатуры.СтатусМаркировки = Перечисления.СтатусыМаркировки.PHYSICAL_MARKING;
		КонецЕсли;
		Если СерияНоменклатуры.НельзяНанестиФизическуюМаркировку 
			И СерияНоменклатуры.СтатусМаркировки = Перечисления.СтатусыМаркировки.ПустаяСсылка() Тогда
			СерияНоменклатуры.СтатусМаркировки = Перечисления.СтатусыМаркировки.MARKING_DENY_NO_PLACE;
		КонецЕсли;
		СерияНоменклатуры.Записать();
		МассивСерий.Добавить(ТекСерия);
	КонецЦикла;

	ДатаНачалаПрисвоенияСерийМеталлам = Константы.ДатаНачалаПрисвоенияСерийМеталлам.Получить();
	Если ДатаНачалаПрисвоенияСерийМеталлам > Документ.Дата или ДатаНачалаПрисвоенияСерийМеталлам = Дата(1, 1, 1) Тогда
		ВестиУчетМеталлаПоСериям = Ложь;
	Иначе
		ВестиУчетМеталлаПоСериям = Истина;
	КонецЕсли;

	ДатаНачалаПрисвоенияСерийКамням = Константы.ДатаНачалаПрисвоенияСерийКамням.Получить();
	Если ДатаНачалаПрисвоенияСерийКамням > Документ.Дата или ДатаНачалаПрисвоенияСерийКамням = Дата(1, 1, 1) Тогда
		ВестиУчетКамнейПоСериям = Ложь;
	Иначе
		ВестиУчетКамнейПоСериям = Истина;
	КонецЕсли;

	Для Каждого СтрокаТоваров Из МассивПустыхСерий Цикл
		Номенклатура = СтрокаТоваров.Номенклатура;

		Если Не ЗначениеЗаполнено(Номенклатура) Тогда

			Продолжить;

		КонецЕсли;

		Если (СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар
			или (СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Металл и ВестиУчетМеталлаПоСериям = Истина 
			и СтрокаТоваров.НеДрагМеталл = Ложь)
			или (СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Вставка и ВестиУчетКамнейПоСериям = Истина)
			или СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Бижутерия
			или СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЮвелирноеИзделие) Тогда

			Если СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.ЮвелирноеИзделие 
				и СтрокаТоваров.Количество <> 1 Тогда

				Текст = "Штрих-код изделию """ + Номенклатура.Наименование + """ не присвоен. 
				|Штрих-код присваивается изделиям с видом номенклатуры ""Ювелирное изделие"" только при количестве равном 1.";
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(Текст, Документ, "Товары[" + (СтрокаТоваров.НомерСтроки - 1) + "].СерияНоменклатуры");

				Продолжить;

			КонецЕсли;

			Если СтрокаТоваров.Вес <> 0 и СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар Тогда

				Текст = "Штрих-код изделию """ + Номенклатура.Наименование + """ не присвоен. 
				|Штрих-код присваивается изделиям с видом номенклатуры ""товар"" без указания веса.";
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(Текст, Документ, "Товары[" + (СтрокаТоваров.НомерСтроки - 1) + "].СерияНоменклатуры");

				Продолжить;

			КонецЕсли;

			Если СтрокаТоваров.Вес = 0 и СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Металл Тогда

				Текст = "Штрих-код изделию """ + Номенклатура.Наименование + """ не присвоен. 
				|Штрих-код присваивается изделиям с видом номенклатуры ""металл"" только при весе большем нуля.";
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(Текст, Документ, "Товары[" + (СтрокаТоваров.НомерСтроки - 1) + "].СерияНоменклатуры");

				Продолжить;

			КонецЕсли;

			Если СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Вставка И (СтрокаТоваров.Вес = 0 Или СтрокаТоваров.Количество = 0) Тогда

				Текст = "Штрих-код изделию """ + Номенклатура.Наименование + """ не присвоен. 
				|Штрих-код присваивается изделиям с видом номенклатуры ""вставка"" только при количестве и весе большем нуля.";
				ОбщегоНазначенияКлиентСерверУ.СообщитьПользователю(Текст, Документ, "Товары[" + (СтрокаТоваров.НомерСтроки - 1) + "].СерияНоменклатуры");

				Продолжить;

			КонецЕсли;

			СерияНоменклатурыОбъект = Справочники.СерииНоменклатуры.СоздатьЭлемент();
			СерияНоменклатурыОбъект.УстановитьНовыйКод();

			Штрихкод = ПрефиксШтрихкода + Прав("000000000000000000" + СерияНоменклатурыОбъект.Код, 12 - СтрДлина(
			ПрефиксШтрихкода));

			СерияНоменклатурыОбъект.Владелец     = Номенклатура;
			СерияНоменклатурыОбъект.Наименование = Штрихкод + УправлениеРозничнойТорговлей.КонтрольныйСимволEAN(
			Штрихкод, 13);

			Если СтрокаТоваров.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Металл Тогда
				СерияНоменклатурыОбъект.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
				СерияНоменклатурыОбъект.Размер                     = Справочники.Размер.ПустаяСсылка();
				СерияНоменклатурыОбъект.Количество                 = 0;
				СерияНоменклатурыОбъект.Весовой 				   = 1;
			ИначеЕсли ЭтоСкупка Тогда
				СерияНоменклатурыОбъект.ХарактеристикаНоменклатуры = СтрокаТоваров.ХарактеристикаНоменклатуры;
				СерияНоменклатурыОбъект.Размер                     = СтрокаТоваров.Размер;
				СерияНоменклатурыОбъект.Количество                 = СтрокаТоваров.Количество;
				СерияНоменклатурыОбъект.Весовой 				   = 1;
			Иначе	
				СерияНоменклатурыОбъект.ХарактеристикаНоменклатуры = СтрокаТоваров.ХарактеристикаНоменклатуры;
				СерияНоменклатурыОбъект.Размер                     = СтрокаТоваров.Размер;
				СерияНоменклатурыОбъект.Количество                 = СтрокаТоваров.Количество;	
				СтрокаТоваров.Свойство("Весовой", СерияНоменклатурыОбъект.Весовой);
			КонецЕсли;

			СерияНоменклатурыОбъект.Вес = СтрокаТоваров.Вес;
			СерияНоменклатурыОбъект.ВесМеталла = СтрокаТоваров.ВесМеталла;

			СерияНоменклатурыОбъект.ОбщийВесВставок = СтрокаТоваров.ОбщийВесВставок;

			СерияНоменклатурыОбъект.ВесМеталлаВЧистоте = СтрокаТоваров.ВесМеталлаВХимЧистоте;

			СтрокаТоваров.Свойство("Качество", СерияНоменклатурыОбъект.Качество);
			СтрокаТоваров.Свойство("НомерГТД", СерияНоменклатурыОбъект.НомерГТД);
			СтрокаТоваров.Свойство("СтранаПроисхождения", СерияНоменклатурыОбъект.СтранаПроисхождения);
			СтрокаТоваров.Свойство("Паспорт", СерияНоменклатурыОбъект.НомерПаспорта);
			СтрокаТоваров.Свойство("УИН", СерияНоменклатурыОбъект.УИН);
			СтрокаТоваров.Свойство("ЦветМеталла", СерияНоменклатурыОбъект.ЦветМеталла);

			СтрокаТоваров.Свойство("ЕстьФизическаяМаркировка", СерияНоменклатурыОбъект.ЕстьФизическаяМаркировка);
			СтрокаТоваров.Свойство("НельзяНанестиФизическуюМаркировку", СерияНоменклатурыОбъект.НельзяНанестиФизическуюМаркировку);
			СтрокаТоваров.Свойство("СтатусМаркировки", СерияНоменклатурыОбъект.СтатусМаркировки);
			Если Не ЗначениеЗаполнено(СерияНоменклатурыОбъект.СтатусМаркировки) Тогда
				Если СерияНоменклатурыОбъект.ЕстьФизическаяМаркировка Тогда
					СерияНоменклатурыОбъект.СтатусМаркировки = Перечисления.СтатусыМаркировки.PHYSICAL_MARKING;
				КонецЕсли;
				Если СерияНоменклатурыОбъект.НельзяНанестиФизическуюМаркировку Тогда
					СерияНоменклатурыОбъект.СтатусМаркировки = Перечисления.СтатусыМаркировки.MARKING_DENY_NO_PLACE;
				КонецЕсли; 
			КонецЕсли;	
			СтрокаТоваров.Свойство("ВидПартийГИИС", СерияНоменклатурыОбъект.ВидПартийГИИС);
			СтрокаТоваров.Свойство("ДополнительнаяКлассификация", СерияНоменклатурыОбъект.ДополнительнаяКлассификация);
			СтрокаТоваров.Свойство("Описание", СерияНоменклатурыОбъект.Комментарий);

			Если СтрокаТоваров.Свойство("ЦветМеталла") = Истина Тогда
				Если ЗначениеЗаполнено(СтрокаТоваров.ЦветМеталла) Тогда

					СерияНоменклатурыОбъект.ЦветМеталла = СтрокаТоваров.ЦветМеталла;

				ИначеЕсли ЗначениеЗаполнено(СтрокаТоваров.Номенклатура.ЦветМеталла) Тогда

					СерияНоменклатурыОбъект.ЦветМеталла = СтрокаТоваров.Номенклатура.ЦветМеталла;

				КонецЕсли;
			КонецЕсли;

			// Заполнять поставщика будем только, если это не собственный контрагент.
			Если ЕстьКонтрагент И Не ЗначениеЗаполнено(СобственныйКонтрагент) Тогда

				СерияНоменклатурыОбъект.Поставщик       = СтрокаТоваров.Контрагент;
				СерияНоменклатурыОбъект.ДоговорПоставки = СтрокаТоваров.ДоговорКонтрагента;

			ИначеЕсли ЭтоВводОстатков И ЗначениеЗаполнено(СтрокаТоваров.ДокументОприходования) Тогда

				ЗначенияРеквизитов = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СтрокаТоваров.ДокументОприходования,
				"Контрагент,ДоговорКонтрагента");

				СерияНоменклатурыОбъект.Поставщик       = ЗначенияРеквизитов.Контрагент;
				СерияНоменклатурыОбъект.ДоговорПоставки = ЗначенияРеквизитов.ДоговорКонтрагента;

			КонецЕсли;

			Если ЕстьРазрушительныйАнализ Тогда
				СтрокаТоваров.Свойство("РазрушительныйАнализ", СерияНоменклатурыОбъект.РазрушительныйАнализ);
			КонецЕсли;

			СерияНоменклатурыОбъект.ДополнительныеСвойства.Вставить("ПроведениеДокумента", Истина);
			СерияНоменклатурыОбъект.Записать();

			Документ.Товары[СтрокаТоваров.НомерСтроки - 1].СерияНоменклатуры = СерияНоменклатурыОбъект.Ссылка;

			МассивСерий.Добавить(СерияНоменклатурыОбъект.Ссылка);

		КонецЕсли;

	КонецЦикла;	
	// Обновление ассортиментной матрицы
	Если Справочники.НастройкаАссортиментнойМатрицы.ОсновнаяНастройка.ИспользуетсяАссортиментнаяМатрица
		И МассивСерий.Количество() > 0 Тогда
		ЮвелирнаяТорговля.ювЗаполнитьСериюПоАссортиментнойМатрицеДляСпискаСерий(МассивСерий);
	КонецЕсли;

КонецПроцедуры
